import 'package:untitled/quiz.dart';

List<Slide> dummySlides = [
  Slide(
      "Στον ελληνικό χώρο το πρόβλημα της έγγειας ιδιοκτησίας γνώρισε τις εντάσεις που παρατηρήθηκαν και σε άλλα ευρωπαϊκά κράτη.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Ο βασιλιάς Κωνσταντίνος Α ́ το 1915 προκάλεσε δύο φορές την παραίτηση της κυβέρνησης Βενιζέλου.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Η αστική στέγαση των προσφύγων που κατέφυγαν στην Ελλάδα μετά τη Μικρασιατική Καταστροφή (1922) συνάντησε περισσότερα εμπόδια από την αγροτική.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Ο παλαίμαχος κρητικός πολιτικός Ι. Σφακιανάκης κάλεσε τον λαό σε καθολική συμπαράσταση προς τους επαναστάτες του Θερίσου (21 Μαρτίου 1905). ",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Η πολιτική των νεοτουρκικών κυβερνήσεων έναντι των Ελλήνων βρισκόταν σε πλήρη συμφωνία με τις εξαγγελίες του προέδρου των ΗΠΑ Ουίλσον. ",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Η πολιτική και κοινωνική επιρροή των σοσιαλιστικών ομάδων και των εργατικών ομαδοποιήσεων, στο τέλος του 19ο υ αιώνα, ήταν σαφώς μεγαλύτερη στην Ελλάδα από εκείνη που άσκησαν αντίστοιχα κινήματα σε βιομηχανικές χώρες της Δύσης αλλά και σε βαλκανικές.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Στο τέλος του 1904 έληξε η περίοδος της Γενικής Συνέλευσης (στην Κρήτη) και προκηρύχθηκαν εκλογές για την ανάδειξη 64 βουλευτών.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Με βάση το άρθρο 11 της Σύμβασης της Λοζάνης ιδρύθηκε η Μικτή Επιτροπή Ανταλλαγής με έδρα την Κωνσταντινούπολη.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Το Μάιο του 1927 ιδρύθηκε η Τράπεζα της Ελλάδος, η οποία άρχισε τη λειτουργία της ένα χρόνο αργότερα.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Μετά τη διάλυση της ΕΑΠ, το 1930, τα χρέη των αγροτών προσφύγων ανέλαβε να εισπράξει η Εθνική Τράπεζα.v",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Το δικαίωμα του «συνέρχεσθαι» και «συνεταιρίζεσθαι» κατοχυρώνεται συνταγματικά το 1844.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Ο Τρικούπης δεν αποδεχόταν το χωρισμό των εξουσιών και στόχευε στη συγκέντρωση και τον έλεγχό τους από το κόμμα.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Το Ελληνικό Τυπογραφείο της Τραπεζούντας συνέβαλε αποφασιστικά στην ανάπτυξη της εθνικής συνείδησης .",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Με τον Οργανικό Νόμο του 1900 δόθηκε οριστική λύση στο Κρητικό ζήτημα.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Η συνθήκη φιλίας και συνεργασίας ανάμεσα στους Μπολσεβίκους και τον Κεμάλ (Μάρτιος 1921) λειτούργησε ως ταφόπετρα του πον τιακού ζητήματος.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Το τελευταίο τέταρτο του 19ου αιώνα δεν προέκυψαν ταξικά κόμματα στην Ελλάδα.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Ο Ελευθέριος Βενιζέλος παραιτήθηκε από τη θέση του ως Υπουργού Δικαιοσύνης της Κρητικής Πολιτείας στις 18 Μαρτίου 1901.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Τον Φεβρουάριο του 1913 πραγματοποιήθηκε η ένωση της Κρήτης με την Ελλάδα.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Το κόστος των Βαλκανικών πολέμων κλόνισε την εθνική οικονομία.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Οι προσπάθειες της ελληνικής κυβέρνησης να αποτρέψει την κρίση του 1932 εξάντλησαν τα αποθέματα της χώρας σε χρυσό και συνάλλαγμα.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Με το Σύνταγμα του 1844 δεν κατοχυρώθηκε το δικαίωμα του συνέρχεσθαι και συνεταιρίζεσθαι.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Ο Θεόδωρος Δηλιγιάννης υποστήριζε ένα κράτος κοινωνικής αλληλεγγύης.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Στην Ελλάδα, αντίθετα από τις άλλες ευρωπαϊκές χώρες, δεν διαμορφώθηκαν ταξικά κόμματα μέχρι τα τέλη του 19ου αιώνα.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Η Τράπεζα της Ελλάδος ιδρύθηκε με αφορμή αίτημα της ΕΑΠ.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Το κίνημα στο Θέρισο υποστηρίχθηκε από την ελληνική κυβέρνηση.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Στον ελληνικό χώρο, το πρόβλημα της έγγειας ιδιοκτησίας δεν γνώρισε τις εντάσεις που παρατηρήθηκαν σε άλλα ευρωπαϊκά ή βαλκανικά κράτη.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Η Ελλάδα του Μεσοπολέμου δεν είχε ολοκληρώσει την αγροτική της μεταρρύθμιση.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Ο Κωλέττης, ως αρχηγός του γαλλικού κόμματος, επεδίωκε μια κυβερνητική πολιτική που θα ενίσχυε τον ρόλο του βασιλιά.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Με την άφιξη των προσφύγων, το έργο της προσωρινής στέγασης ανέλαβε το Υπουργείο Περιθάλψεως.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Οι Μεγάλες Δυνάμεις τήρησαν ενιαία στάση έναντι των επαναστατών στο Θέρισο.",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Στις 4 Αυγούστου 1936 ο Ιωάννης Μεταξάς, με την ανοχή του παλατιού, προχώρησε στην κατάλυση του κοινοβουλευτικού καθεστώτος και στην επιβολή δικτατορίας.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Το 1844 ο Αλέξανδρος Μαυροκορδάτος διατύπωσε με σαφήνεια στην Εθνοσυνέλευση τη «Μεγάλη Ιδέα».",
      ["Σωστό", "Λάθος"],
      1
  ),
  Slide(
      "Το δημοψήφισμα της 3ης Νοεμβρίου 1935 έδωσε τέλος στη βασιλευόμενη δημοκρατία με ποσοστό 97,6%.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Το θέμα των δικαιωμάτων των ετεροχθόνων στην Εθνοσυνέλευση, που συνήλθε μετά την Επανάσταση του 1843, έδειξε τη βαθύτερη διάσταση που υπήρχε στην κοινωνία της εποχής.",
      ["Σωστό", "Λάθος"],
      0
  ),
  Slide(
      "Τα γεγονότα της περιόδου 1895-1898, που ήταν καθοριστικά για την τύχη της Κρήτης, προκάλεσαν κύμα μεγάλης φυγής προσφύγων.",
      ["Σωστό", "Λάθος"],
      1
  ),

];